In [ ]:
# !pip install psycopg2-binary pandas sqlalchemy

In [3]:
import pandas as pd
import os

In [4]:
#pip install sqlalchemy ##usually aconda will install aqlalchemy
#pip install psycopg2-binary ##psycopg2 library (a popular PostgreSQL adapter for Python)
from sqlalchemy import create_engine

In [9]:
# Define database connection parameters
db_user = 'root'
db_password = 'root'
db_host = 'localhost'  # or the hostname of your database server
db_port = '5432'  # default PostgreSQL port
db_name = 'ny_taxi'  # your database name

# Create the database connection string
connection_string = f'postgresql://{db_user}:{db_password}@{db_host}:{db_port}/{db_name}'

# Create the database engine
engine = create_engine(connection_string)

#engine = create_engine('postgresql://root:root@localhost:5432/ny_taxi')

In [10]:
engine.connect()

In [21]:
#Q3-1:
# Query the table using pandas read_sql function
query = "SELECT COUNT(*) FROM public.yellow_taxi_trips \
WHERE lpep_pickup_datetime >= '2019-10-01' AND lpep_dropoff_datetime < '2019-11-01' \
AND trip_distance <=1; "

# Run the query and store the result in a DataFrame
df = pd.read_sql(query, engine)

# Display the first few rows of the result
df.head()

    count
0  104802

In [23]:
#Q3-2
query = "SELECT COUNT(*) FROM public.yellow_taxi_trips \
WHERE lpep_pickup_datetime >= '2019-10-01' AND lpep_dropoff_datetime < '2019-11-01' \
AND trip_distance <=3 AND trip_distance >1;"

df = pd.read_sql(query, engine)
df.head()

    count
0  198924

In [24]:
#Q3-3
query = "SELECT COUNT(*) FROM public.yellow_taxi_trips \
WHERE lpep_pickup_datetime >= '2019-10-01' AND lpep_dropoff_datetime < '2019-11-01' \
AND trip_distance <=7 AND trip_distance >3;"

df = pd.read_sql(query, engine)
df.head()

    count
0  109603

In [25]:
#Q3-4
query = "SELECT COUNT(*) FROM public.yellow_taxi_trips \
WHERE lpep_pickup_datetime >= '2019-10-01' AND lpep_dropoff_datetime < '2019-11-01' \
AND trip_distance <=10 AND trip_distance >7;"

df = pd.read_sql(query, engine)
df.head()

   count
0  27678

In [26]:
#Q3-5
query = "SELECT COUNT(*) FROM public.yellow_taxi_trips \
WHERE lpep_pickup_datetime >= '2019-10-01' AND lpep_dropoff_datetime < '2019-11-01' \
AND trip_distance >10;"

df = pd.read_sql(query, engine)
df.head()

   count
0  35189

In [28]:
#Q4
query = "SELECT lpep_pickup_datetime,  max(trip_distance) AS longest_trip \
FROM public.yellow_taxi_trips \
GROUP BY lpep_pickup_datetime \
ORDER BY longest_trip DESC \
LIMIT 5;"

df = pd.read_sql(query, engine)
df.head()

  lpep_pickup_datetime  longest_trip
0  2019-10-31 23:23:41        515.89
1  2019-10-11 20:34:21         95.78
2  2019-10-26 03:02:39         91.56
3  2019-10-24 10:59:58         90.75
4  2019-10-05 16:42:04         85.23

In [33]:
#Q5:
query = "SELECT SUM(t.total_amount) AS sum_total, l.\"Zone\" \
FROM (SELECT * FROM public.yellow_taxi_trips WHERE lpep_pickup_datetime <'2019-10-19' AND lpep_pickup_datetime >= '2019-10-18') AS t \
LEFT JOIN lookup_table l \
ON t.\"PULocationID\" = l.\"LocationID\" \
GROUP BY l.\"Zone\" \
HAVING SUM(t.total_amount) > 13000 \
ORDER BY sum_total DESC;"

df = pd.read_sql(query, engine)
df.head()

   sum_total                 Zone
0   18686.68    East Harlem North
1   16797.26    East Harlem South
2   13029.79  Morningside Heights

#StudyNotes
- Get all the column names

SELECT column_name
FROM information_schema.columns
WHERE table_name = 'yellow_taxi_trips';
- If PULocationID was defined with mixed case and double quotes, you must reference it exactly as it was created:

SELECT "PULocationID" FROM yellow_taxi_trips;

In [34]:
#Q6:#1.find the LocationID
query = "SELECT * FROM lookup_table \
WHERE \"Zone\" = 'East Harlem North';"

df = pd.read_sql(query, engine)
df.head()

   index  LocationID    Borough               Zone service_zone
0     73          74  Manhattan  East Harlem North    Boro Zone

In [35]:
##2.Find the DOLocationID with largest tip_amount ->132
query = "SELECT \"DOLocationID\", tip_amount \
FROM public.yellow_taxi_trips \
WHERE lpep_pickup_datetime <'2019-11-1' AND lpep_pickup_datetime >= '2019-10-1' AND \"PULocationID\" = 74 \
ORDER BY tip_amount DESC;"

df = pd.read_sql(query, engine)
df.head()

   DOLocationID  tip_amount
0           132       87.30
1           263       80.88
2            74       40.00
3             1       26.45
4           132       20.00

In [36]:
#3.find the Zone   -->  JFK Airport
query = "SELECT * FROM lookup_table \
WHERE \"LocationID\" =132;"

df = pd.read_sql(query, engine)
df.head()

   index  LocationID Borough         Zone service_zone
0    131         132  Queens  JFK Airport     Airports